Revit 2026 API

# ComboBoxMemberData Properties

---

The ComboBoxMemberData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GroupName | Gets or sets a group name for the ComboBoxMember. |
|  | Image | The image shown on the ComboBoxMember. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ItemData) |
|  | LongDescription | Long description of the command tooltip (Inherited from RibbonItemData) |
|  | Name | The internal name of the item. (Inherited from ItemData) |
|  | Text | The user-visible text of the ComboBoxMember. |
|  | ToolTip | The tooltip of item. (Inherited from ItemData) |
|  | ToolTipImage | The image to show as a part of the button extended tooltip (Inherited from RibbonItemData) |

#### Reference

ComboBoxMemberData Class

Autodesk.Revit.UI Namespace